:SETUP:    
#+TITLE: High-Frequency Consumption Panel: Preliminary Report
#+AUTHOR: Reajul Chowdhury, Elliott Collins, Ethan Ligon, Munshi Sulaiman
#+DATE: 2017-02-09
#+OPTIONS: texht:t toc:nil
#+LATEX_CLASS_OPTIONS: [12pt,article]
#+LATEX_HEADER:       \newcommand{\T}{\top}
#+LATEX_HEADER:       \newcommand{\E}{\ensuremath{\mbox{E}}}
#+LATEX_HEADER:       \newcommand{\R}{\ensuremath{\mathbb{R}}}
#+LATEX_HEADER:       \newcommand{\one}{\ensuremath{\mathbbm{1}}}
#+LATEX_HEADER:       \newcommand{\Eq}[1]{(\ref{eq:#1})}
#+LATEX_HEADER:       \renewcommand{\vec}[1]{\boldsymbol{#1}}
#+LaTeX_HEADER:       \usepackage{biblatex}
#+LaTeX_HEADER:       \bibliography{prospectus}
#+LaTeX_HEADER:       \usepackage[style=authordate]{biblatex}
#+LATEX_HEADER_EXTRA: \usepackage{bbm}
#+LATEX_HEADER_EXTRA: \usepackage{dcolumn}\newcolumntype{d}[1]{D{.}{.}{#1}}
#+LATEX_HEADER_EXTRA: \newtheorem{proposition}{Proposition} \newcommand{\Prop}[1]{Proposition \ref{prop:#1}}
#+LATEX_HEADER_EXTRA: \newtheorem{theorem}{Theorem} \newcommand{\Thm}[1]{Theorem \ref{thm:#1}}
#+LATEX_HEADER_EXTRA: \newtheorem{remark}{Remark} \newcommand{\Rem}[1]{Remark \ref{rem:#1}}
#+LATEX_HEADER_EXTRA: \newtheorem{condition}{Condition} \newcommand{\Cond}[1]{Condition \ref{cond:#1}}
#+LATEX_HEADER_EXTRA: \newtheorem{lemma}{Lemma} \newcommand{\Lem}[1]{Lemma \ref{prop:#1}}
#+LATEX_HEADER_EXTRA: \newcommand{\Fig}[1]{Figure \ref{fig:#1}} \newcommand{\Tab}[1]{Table \ref{tab:#1}}
:END:      

#+begin_abstract

#+end_abstract
\newpage

** Consumption
   
|                                         | Food          | FoodShr       | Month         | Tot           | Year          | logTot        |
|-----------------------------------------+---------------+---------------+---------------+---------------+---------------+---------------|
| TUP*2016                                | $-1.18^{**}$  | $ 0.00^{***}$ | $-0.00$       | $-1.22^{*}$   | $-0.00$       | $-0.00^{***}$ |
|                                         | $( 0.53)$     | $( 0.00)$     | $( 0.00)$     | $( 0.69)$     | $( 0.00)$     | $( 0.00)$     |
| CSH*2016                                | $ 0.74$       | $ 0.00$       | $ 0.00$       | $ 1.74^{**}$  | $ 0.00$       | $ 0.00$       |
|                                         | $( 0.66)$     | $( 0.00)$     | $( 0.00)$     | $( 0.86)$     | $( 0.00)$     | $( 0.00)$     |
| Bsln2013                                | $-0.04^{***}$ | $ 0.07^{**}$  | $-0.11$       | $-0.01$       | $ 0.05$       | $ 0.06^{***}$ |
|                                         | $( 0.01)$     | $( 0.03)$     | $( 0.15)$     | $( 0.01)$     | $( 0.03)$     | $( 0.02)$     |
| 2014                                    | $29.50^{***}$ | $ 0.69^{***}$ | $ 8.32^{***}$ | $38.86^{***}$ | $ 2.12^{***}$ | $ 3.25^{***}$ |
|                                         | $( 1.69)$     | $( 0.03)$     | $( 0.80)$     | $( 2.19)$     | $( 0.36)$     | $( 0.08)$     |
| 2015                                    | $28.42^{***}$ | $ 0.64^{***}$ | $10.14^{***}$ | $39.83^{***}$ | $ 2.74^{***}$ | $ 3.29^{***}$ |
|                                         | $( 1.49)$     | $( 0.03)$     | $( 0.74)$     | $( 1.92)$     | $( 0.33)$     | $( 0.08)$     |
| 2016                                    | $28.74^{***}$ | $-0.00^{***}$ | $-0.00^{**}$  | $43.76^{***}$ | $-0.00$       | $-0.00^{***}$ |
|                                         | $( 0.49)$     | $( 0.00)$     | $( 0.00)$     | $( 0.65)$     | $( 0.00)$     | $( 0.00)$     |
| TUP*2014                                | $ 5.30^{**}$  | $-0.01$       | $ 1.94^{*}$   | $ 8.79^{***}$ | $ 1.28^{**}$  | $ 0.23^{***}$ |
|                                         | $( 2.44)$     | $( 0.02)$     | $( 1.02)$     | $( 3.15)$     | $( 0.50)$     | $( 0.06)$     |
| TUP*2015                                | $-0.46$       | $-0.01$       | $ 1.13$       | $ 0.99$       | $ 0.09$       | $ 0.04$       |
|                                         | $( 2.29)$     | $( 0.01)$     | $( 0.96)$     | $( 2.94)$     | $( 0.47)$     | $( 0.05)$     |
| CSH*2014                                | $-1.63$       | $ 0.01$       | $ 0.96$       | $-1.42$       | $-0.38$       | $-0.02$       |
|                                         | $( 3.05)$     | $( 0.02)$     | $( 1.28)$     | $( 3.92)$     | $( 0.62)$     | $( 0.07)$     |
| CSH*2015                                | $ 2.40$       | $-0.01$       | $ 2.17^{*}$   | $ 5.00$       | $ 0.06$       | $ 0.14^{**}$  |
|                                         | $( 2.95)$     | $( 0.02)$     | $( 1.24)$     | $( 3.80)$     | $( 0.61)$     | $( 0.07)$     |
| Bsln_NAN                                | $-0.84$       | $ 0.09^{***}$ | $-0.74$       | $ 1.13$       | $ 0.80^{*}$   | $ 0.31^{***}$ |
|                                         | $( 0.79)$     | $( 0.03)$     | $( 0.87)$     | $( 1.04)$     | $( 0.43)$     | $( 0.09)$     |
| F-stat                                  | $ 3.28$       | $ 6.30$       | $ 2.23$       | $ 3.20$       | $ 2.12$       | $ 4.77$       |
|                                         |               |               |               |               |               |               |
| N                                       | $14723.00$    | $1295.00$     | $1296.00$     | $14733.00$    | $1260.00$     | $1305.00$     |
|                                         |               |               |               |               |               |               |
| CTL mean                                | $27.46^{*}$   | $ 0.70^{***}$ | $ 9.73$       | $39.80^{*}$   | $ 3.07$       | $ 3.52^{***}$ |
|                                         | $(15.54)$     | $( 0.18)$     | $(10.38)$     | $(22.18)$     | $( 5.48)$     | $( 0.61)$     |
| $\beta^{TUP}_{2014}-\beta^{CSH}$        | $ 2.89$       | $-0.01$       | $-0.23$       | $ 3.80$       | $ 1.22$       | $ 0.09$       |
|                                         | $( 3.82)$     | $( 0.02)$     | $( 1.59)$     | $( 4.93)$     | $( 0.78)$     | $( 0.09)$     |
| $\beta^{TUP}_{2015}-\beta^{CSH}$        | $-2.86$       | $-0.00$       | $-1.04$       | $-4.01$       | $ 0.03$       | $-0.10$       |
|                                         | $( 3.12)$     | $( 0.02)$     | $( 1.30)$     | $( 4.01)$     | $( 0.64)$     | $( 0.07)$     |
| $\beta^{TUP}_{2016}-\beta^{CSH}_{2016}$ | $-1.92^{***}$ | $ 0.00^{***}$ | $-0.00$       | $-2.96^{***}$ | $-0.00$       | $-0.00^{***}$ |
|                                         | $( 0.68)$     | $( 0.00)$     | $( 0.00)$     | $( 0.88)$     | $( 0.00)$     | $( 0.00)$     |





 |                                         | Food          | FoodShr       | Month         | Tot           | Year          | logTot        |
 |-----------------------------------------+---------------+---------------+---------------+---------------+---------------+---------------|
 | Bsln2013                                | $ 0.03$       | $ 0.07^{**}$  | $-0.11$       | $ 0.06^{**}$  | $ 0.05$       | $ 0.06^{***}$ |
 |                                         | $( 0.02)$     | $( 0.03)$     | $( 0.15)$     | $( 0.03)$     | $( 0.03)$     | $( 0.02)$     |
 | 2014                                    | $27.24^{***}$ | $ 0.69^{***}$ | $ 8.32^{***}$ | $36.33^{***}$ | $ 2.12^{***}$ | $ 3.25^{***}$ |
 |                                         | $( 1.16)$     | $( 0.03)$     | $( 0.80)$     | $( 1.65)$     | $( 0.36)$     | $( 0.08)$     |
 | 2015                                    | $25.97^{***}$ | $ 0.64^{***}$ | $10.14^{***}$ | $37.26^{***}$ | $ 2.74^{***}$ | $ 3.29^{***}$ |
 |                                         | $( 1.06)$     | $( 0.03)$     | $( 0.74)$     | $( 1.52)$     | $( 0.33)$     | $( 0.08)$     |
 | 2016                                    | $24.65^{***}$ | $-0.00^{***}$ | $-0.00^{**}$  | $39.15^{***}$ | $-0.00$       | $-0.00^{***}$ |
 |                                         | $( 1.07)$     | $( 0.00)$     | $( 0.00)$     | $( 1.53)$     | $( 0.00)$     | $( 0.00)$     |
 | TUP*2014                                | $ 5.79^{***}$ | $-0.01$       | $ 1.94^{*}$   | $ 9.08^{***}$ | $ 1.28^{**}$  | $ 0.23^{***}$ |
 |                                         | $( 1.48)$     | $( 0.02)$     | $( 1.02)$     | $( 2.10)$     | $( 0.50)$     | $( 0.06)$     |
 | TUP*2015                                | $ 0.23$       | $-0.01$       | $ 1.13$       | $ 1.33$       | $ 0.09$       | $ 0.04$       |
 |                                         | $( 1.40)$     | $( 0.01)$     | $( 0.96)$     | $( 1.98)$     | $( 0.47)$     | $( 0.05)$     |
 | CSH*2014                                | $-1.25$       | $ 0.01$       | $ 0.96$       | $-1.25$       | $-0.38$       | $-0.02$       |
 |                                         | $( 1.85)$     | $( 0.02)$     | $( 1.28)$     | $( 2.61)$     | $( 0.62)$     | $( 0.07)$     |
 | CSH*2015                                | $ 3.04^{*}$   | $-0.01$       | $ 2.17^{*}$   | $ 5.31^{**}$  | $ 0.06$       | $ 0.14^{**}$  |
 |                                         | $( 1.80)$     | $( 0.02)$     | $( 1.24)$     | $( 2.55)$     | $( 0.61)$     | $( 0.07)$     |
 | TUP*2016                                | $ 0.28$       | $ 0.00^{***}$ | $-0.00$       | $ 0.30$       | $-0.00$       | $-0.00^{***}$ |
 |                                         | $( 1.41)$     | $( 0.00)$     | $( 0.00)$     | $( 2.00)$     | $( 0.00)$     | $( 0.00)$     |
 | CSH*2016                                | $ 1.25$       | $ 0.00$       | $ 0.00$       | $ 1.47$       | $ 0.00$       | $ 0.00$       |
 |                                         | $( 1.80)$     | $( 0.00)$     | $( 0.00)$     | $( 2.57)$     | $( 0.00)$     | $( 0.00)$     |
 | Bsln_NAN                                | $ 3.43^{***}$ | $ 0.09^{***}$ | $-0.74$       | $ 4.48^{**}$  | $ 0.80^{*}$   | $ 0.31^{***}$ |
 |                                         | $( 1.27)$     | $( 0.03)$     | $( 0.87)$     | $( 1.83)$     | $( 0.43)$     | $( 0.09)$     |
 | F-stat                                  | $ 5.02$       | $ 6.30$       | $ 2.23$       | $ 3.50$       | $ 2.12$       | $ 4.77$       |
 |                                         |               |               |               |               |               |               |
 | N                                       | $1980.00$     | $1295.00$     | $1296.00$     | $1990.00$     | $1260.00$     | $1305.00$     |
 |                                         |               |               |               |               |               |               |
 | CTL mean                                | $27.46^{*}$   | $ 0.70^{***}$ | $ 9.73$       | $39.80^{*}$   | $ 3.07$       | $ 3.52^{***}$ |
 |                                         | $(15.54)$     | $( 0.18)$     | $(10.38)$     | $(22.18)$     | $( 5.48)$     | $( 0.61)$     |
 | $\beta^{TUP}_{2014}-\beta^{CSH}$        | $ 2.74$       | $-0.01$       | $-0.23$       | $ 3.78$       | $ 1.22$       | $ 0.09$       |
 |                                         | $( 2.31)$     | $( 0.02)$     | $( 1.59)$     | $( 3.27)$     | $( 0.78)$     | $( 0.09)$     |
 | $\beta^{TUP}_{2015}-\beta^{CSH}$        | $-2.81$       | $-0.00$       | $-1.04$       | $-3.98$       | $ 0.03$       | $-0.10$       |
 |                                         | $( 1.88)$     | $( 0.02)$     | $( 1.30)$     | $( 2.66)$     | $( 0.64)$     | $( 0.07)$     |
 | $\beta^{TUP}_{2016}-\beta^{CSH}_{2016}$ | $-0.97$       | $ 0.00^{***}$ | $-0.00$       | $-1.16$       | $-0.00$       | $-0.00^{***}$ |
 |                                         | $( 1.88)$     | $( 0.00)$     | $( 0.00)$     | $( 2.67)$     | $( 0.00)$     | $( 0.00)$     |

  

 #+name: neediness_analysis
 #+begin_src python :dir ../analysis :noweb no-export :results values :exports none :tangle DevLunch_analysis.py
 <<get_mobile_data>>
 <<regression_tools>>

 y,z,market = M[ITEMS], M[HH_vars], M["Location"]
 b,ce,d,se,V = nd.estimate_bdce_with_missing_values(y,z,market=market,return_se=True,return_v=True,time_index=0)

 print("Getting Loglambdas")
 bphi,logL=nd.get_loglambdas(ce,TEST="warn")
 logL /=logL.std()
 M["lambdas"]=logL
 fig, ax = plt.subplots(4, 1)
 for i,mnth in enumerate(Datename.values()):
     M.loc[mnth].groupby("Group")['lambdas'].plot(kind='kde',ax=ax[i])
     ax[i].set_xlim(-3,3)
     if not i: ax[i].legend()
 plt.savefig("loglambdas_by_group.png")
 plt.clf()

 #~ Follow TUP regressions
 M["Total"] = M[ITEMS].sum(1)
 bL = M.loc['0June2013','lambdas']
 bL.name="baseline"
 M = M.join(bL)
 M = M.ix[Datename.values()]
 M = M.join(pd.get_dummies(M["Group"]))
 models = {}
 models["lambdas"] = smf.ols("lambdas ~ -1 + C(t) + Cash + TUP + baseline",M).fit()
 models["Total"] = smf.ols("Total ~ -1 + C(t) + Cash + TUP + baseline",M).fit()
 models["Sell_amt"] = smf.ols("Sell ~ -1 + C(t) + Cash + TUP",M).fit()
 models["Buy_amt"] = smf.ols("Buy  ~ -1 + C(t) + Cash + TUP",M).fit()
 models["Sell_any"] = smf.ols("iSell ~ -1 + C(t) + Cash + TUP",M).fit()
 models["Buy_any"] = smf.ols("iBuy  ~ -1 + C(t) + Cash + TUP",M).fit()

 regTAB = reg_table(models, orgtbl=True)
 return regTAB

 #+END_SRC

 #+RESULTS: neediness_analysis
 #+end_example

 
